backend/app/controllers/api/v1/boards_controller.rb

            def create
                @board = Board.new(board_params)
                @board.active_player = 'b' # 初期プレイヤーを設定
                if @board.save
---
INSERT INTO "boards" ("name", "created_at", "updated_at", "active_player") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "string"], ["created_at", "2024-12-01 04:12:59.782012"], ["updated_at", "2024-12-01 04:12:59.782012"], ["active_player", "b"]]

            def set_board
                @board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]